#+title: Kubeconfig Deepdive

* issue

The French internet provider Orange seems to block outbound TCP connections to quite a few ports... it's a strange practice, but I've seen it before.
#+begin_src shell
(
kubectl --request-timeout=2s version
) 2>&1 | grep unreachable\\\|Unable
:
#+end_src

#+RESULTS:
#+begin_example
I0728 08:17:29.438592   77448 versioner.go:56] Remote kubernetes server unreachable
Unable to connect to the server: context deadline exceeded
#+end_example

* verifing that ports are actually blocked on Orange (French ISP)

Here we use curl to connect to the same host with a 2 second timeout and insecurely (to ignore any SSL issues):
#+begin_src shell
curl --no-progress-meter --max-time 2 -k https://k8s.cloudnative.nz:6443 2>&1
#+end_src

#+RESULTS:
#+begin_example
curl: (28) Connection timed out after 2003 milliseconds
#+end_example

* Successful curl to our kubernetes API on port 21
We are forbidden to *do* much here without authentication, but we *did successfully connect*!
#+begin_src shell
curl --no-progress-meter --max-time 2 -k https://k8s.cloudnative.nz:21 2>&1
#+end_src

#+RESULTS:
#+begin_example
{
  "kind": "Status",
  "apiVersion": "v1",
  "metadata": {},
  "status": "Failure",
  "message": "forbidden: User \"system:anonymous\" cannot get path \"/\"",
  "reason": "Forbidden",
  "details": {},
  "code": 403
}
#+end_example

* Resolution

Now we can successfully connect to our redirected port 21 to evade the French blockade!
#+begin_src shell
kubectl --request-timeout=2s version
#+end_src

#+RESULTS:
#+begin_example
Client Version: version.Info{Major:"1", Minor:"26", GitVersion:"v1.26.3", GitCommit:"9e644106593f3f4aa98f8a84b23db5fa378900bd", GitTreeState:"clean", BuildDate:"2023-03-15T13:40:17Z", GoVersion:"go1.19.7", Compiler:"gc", Platform:"darwin/amd64"}
Kustomize Version: v4.5.7
Server Version: version.Info{Major:"1", Minor:"27", GitVersion:"v1.27.3", GitCommit:"25b4e43193bcda6c7328a6d147b1fb73a33f1598", GitTreeState:"clean", BuildDate:"2023-06-14T09:47:40Z", GoVersion:"go1.20.5", Compiler:"gc", Platform:"linux/amd64"}
#+end_example
** setting KUBECONFIG env in emacs
This populates to subprocesses like shell src blocks
#+begin_src elisp
(setenv "KUBECONFIG" "/Users/hh/.kube/config-cloudnative.nz")
#+end_src

#+RESULTS:
: /Users/hh/.kube/config-cloudnative.nz
